{"data":{"stitches":{"johnHeadsPastThe":{"content":["John heads past the stream. The sound of people drifts over, but nobody can be seen. \"Eh, figures, looks like there's people there anyways.\" John starts jogging into the woods.",{"linkPath":"johnCrashesThrou","notIfConditions":null,"option":"Follow him","ifConditions":null}]},"sweetTwoShotsJoh":{"content":["\"Sweet, two shots!\" John pulls out the clip and sees two bullets slotted inside. He carefully replaces the clip and loads the barrel, aiming towards the beehive.",{"divert":"likeShootingFish"},{"flagName":"shoot"}]},"johnExpressesHis2":{"content":["John expresses his condolences, and the ranger walks off. \"Jeez...\" John says, \"What a terrible accident...\"",{"linkPath":"whenHesSureTheRa","notIfConditions":null,"option":"Wait, it couldn't be...","ifConditions":[{"ifCondition":"shoot"}]},{"linkPath":"laterThatNightJo","notIfConditions":[{"notIfCondition":"shoot"}],"option":"Head home","ifConditions":null},{"notIfCondition":"confrontation"},{"notIfCondition":"skipstream"}]},"johnSitsUpAndSee":{"content":["John sits up and sees the tree with the giant lightning scar running through it. \"Hey, that's pretty cool,\" he says as he walks over and examines the bark more closely.",{"divert":"withALitheMotion"}]},"aForestRangerIsK":{"content":["A forest ranger is kneeling by the side of the path up ahead. John approaches carefully, and the ranger waves.",{"divert":"heyThereHaveYouB"}]},"donnyWatchesAsJo":{"content":["Donny watches as John simply lingers there, listening to the sounds of the river. This is John's happy place, where he feels most content, so Donny is a little sad to have to urge him to move on.",{"divert":"johnSighsAndStar"}]},"johnMakesHisWayD":{"content":["John makes his way down again, carefully. When he reaches the ground, he sits for a moment.",{"linkPath":"maybeIWasALittle","notIfConditions":null,"option":"Thinking of the tourists?","ifConditions":[{"ifCondition":"tourists"}]},{"linkPath":"iWasWayTooHarshT","notIfConditions":null,"option":"Thinking of the people at the stream?","ifConditions":[{"ifCondition":"confrontation"}]},{"linkPath":"theresSoMuchViol","notIfConditions":null,"option":"Thinking of the gun?","ifConditions":[{"ifCondition":"gun"}]},{"linkPath":"imActuallyGladID","notIfConditions":null,"option":"Thinking of the stream?","ifConditions":[{"ifCondition":"skipstream"}]},{"linkPath":"iLoveThisPlaceJo","notIfConditions":null,"option":"Thinking of life?","ifConditions":null}]},"iWasWayTooHarshT":{"content":["\"I was way too harsh to those people at the stream,\" John says quietly. \"I love swimming in that stream, and it's not right to keep others from experiencing that peace.\" Donny understands what John is feeling, a mixture of regret and sympathy, and lets the silence hang in the air for a few minutes.",{"divert":"timeToHeadBackJo"}]},"asJohnReachesFor":{"content":["As John reaches for one of the highest parts of the tree, the branch he is standing on suddenly snaps. With a sickening rustle, John falls like a stone, bouncing off the larger branches but unable to get a hold to them. He hits the ground with a deep thud.",{"divert":"johnsEyesMoveBac"}]},"beforeDonnyCanEv":{"content":["Before Donny can even think about it, John starts running towards the people in the water screaming and waving the gun. For a split second, time seems to stand still, then moves at a rapid pace.",{"divert":"anOlderManStandi"}]},"forAMomentItSeem":{"content":["For a moment, it seems like the stream is just as they left it. However, as they move through the trees John suddenly stops.",{"divert":"aForestRangerIsK"}]},"theBeesAreMoving":{"content":["The bees are moving in and out of the hive, industrious and monotonous. John has a sad look on his face as he examines them. \"I wonder what would really happen if their whole world just crumbled around them, how they would pick things back up again.\"",{"divert":"JohnReachesDownT"}]},"johnGetsAMischie":{"content":["John gets a mischievous look in his eyes, and pulls out the gun. \"Lets see how fast they can run from a psycho in the woods.\"",{"divert":"beforeDonnyCanEv"}]},"maybeIWasALittle":{"content":["\"Maybe I was a little hard on those tourists,\" John says quietly. \"I love these woods, and they do too, which is why they climb up hills and stack rocks.\" Donny understands what John is feeling, a mixture of regret and frustration, and lets the silence hang in the air for a few minutes.",{"divert":"timeToHeadBackJo"}]},"johnReclinesOnAn":{"content":["John reclines on an old log and looks around him. As far as the eye can see, there is nothing but woods. It's as though the human race is nonexistent out here.",{"divert":"woahWhatIsThatJo"}]},"whenHesSureTheRa":{"content":["When he's sure the ranger is out of sight, John pulls the spent gun out of his pocket. He turns in place a few times, trying to measure out directions. After a moment, his face falls, and he looks down at the gun.",{"divert":"ohMyGodIWasShoot"}]},"johnPausesForAMo":{"content":["John pauses for a moment, then looks out towards the deep woods. \"Now that I think about it, I'm not in much of a swimming mood today.\" Donny is a little hesitant with this sudden shift, but follows John's lead.",{"divert":"johnHeadsPastThe"},{"flagName":"skipstream"}]},"iCantBelieveThat":{"content":["\"I can't believe that!\" He suddenly bursts with a smile on his face. Some checking reveals a few stings, but nothing serious. Most of the bees had stopped following after a few seconds.",{"linkPath":"thatsProbablyEno","notIfConditions":null,"option":"Lucky break","ifConditions":null}]},"whenTheGunGoesOf":{"content":["When the gun goes off a second time, the beehive shakes and almost falls from the tree. John freezes for a moment, making sure no bees are about to swarm him. When in becomes clear that nothing will happen, he relaxes and smiles.",{"linkPath":"thatsProbablyEno","notIfConditions":null,"option":"Head back home","ifConditions":null}]},"theresSoMuchViol":{"content":["\"There's so much violence in the world,\" John says. \"This gun was probably used to kill someone, and yet it wound up just sitting in the woods for who knows how long.\" Donny understands what John is feeling, a mixture of sympathy and frustration, and lets the silence hang in the air for a few minutes.",{"divert":"timeToHeadBackJo"}]},"afterAFewHoursJo":{"content":["After a few hours, John's breathing finally stops, but the pain stopped long before that.",{"divert":"donnyPutsHisPenD"}]},"iHaveAGoodFeelin":{"content":["\"I have a good feeling about that stream today, It should be empty,\" John says, upbeat. The stream is his favorite part of the woods, but it's also a very popular spot. It's likely some people will be swimming today.",{"linkPath":"dammitJohnExclai","notIfConditions":null,"option":"Head to the stream","ifConditions":null},{"linkPath":"johnPausesForAMo","notIfConditions":null,"option":"Skip it today","ifConditions":null},{"ifCondition":"happy"}]},"ohIKnowJohnExcla":{"content":["\"Oh, I know!\" John exclaims as he starts to look through his pockets. He pulls out the gun from earlier. It's still dirty, but he uses his sleeve to clean it off a bit. Donny knows that John has a little bit of training, so he knows John won't blow his head off or anything.",{"divert":"sweetTwoShotsJoh"}]},"heyDipshitsWhyDo":{"content":["\"Hey dipshits, why don't you find your own spot to swim?\" John walks right up to the people swimming, waving his arms and yelling. They stare at him intently.",{"divert":"weHaveJustAsMuch"},{"flagName":"confrontation"}]},"johnLooksUpFromF":{"content":["John looks up from from the ground, moving into a sitting position. \"Woah, that's the biggest hive I've ever seen. I wonder how many bees are in there.\"",{"linkPath":"theBeesAreMoving","notIfConditions":null,"option":"Take a closer look","ifConditions":null},{"linkPath":"ohIKnowJohnExcla","notIfConditions":null,"option":"Have some fun","ifConditions":[{"ifCondition":"gun"}]}]},"anOlderManStandi":{"content":["An older man standing near the the bank of the stream sees John running and immediately pulls something out of his waistband. With a slight motion of his arm, John simply stumbles and falls to the ground. The older man lowers his hand, the gun clearly visible now.",{"divert":"whatTheHellHappe"}]},"nothingIsBetterT":{"content":["\"Nothing is better than a walk in the woods, am I right?\" John is overly enthusiastic, but he means well, so Donny smiles and nods.",{"divert":"donnyDoesntMuchC"},{"pageNum":1},{"pageLabel":" The Hill"}]},"asTheTearsSlowly":{"content":["As the tears slowly start to drift down his face, John feels vaguely at peace. Out here, alone, this is the place he loves. Dying here wasn't so bad, all things considered.",{"divert":"afterAFewHoursJo"}]},"withALaughOfGlee":{"content":["With a laugh of glee, John keeps climbing even higher, to where the branches are barely strong enough to hold his weight.",{"divert":"asJohnReachesFor"}]},"theHillIsWideAnd":{"content":["The hill is wide and flat at the top, and covered with rocks. Tourists often stack the rocks into piles, trying to outdo each other as the piles get higher and higher. John kicks over some of the tallest piles.",{"divert":"cantThoseDamnIdi"}]},"whateverThoseAss":{"content":["\"Whatever, those assholes can have the steam for today.\" John reluctantly turns away. He starts to run to let off some steam.",{"linkPath":"johnCrashesThrou","notIfConditions":null,"option":"Run through the woods","ifConditions":null}]},"theBeesExplodeOu":{"content":["The bees explode out of the hive in all directions, and John almost falls as he bolts away. Donny follows close after John as they race from the hive. After a few exhausting minutes, John stops running to catch his breath.",{"divert":"iCantBelieveThat"}]},"johnExpressesHis1":{"content":["John expresses his condolences, and the ranger walks off. \"Jeez...\" John says, \"I'm glad I didn't stick around.",{"divert":"johnExpressesHis2"},{"ifCondition":"skipstream"}]},"donnyDoesntMuchC":{"content":["Donny doesn't much care for hiking in the woods - or anything outdoors - but a nice walk in the fresh air would definitely help him get beyond some serious writer's block he has been experiencing lately.",{"divert":"upOverTheRiseOrT"}]},"ohMyGodIWasShoot":{"content":["\"Oh my god, I was shooting in the direction of the stream, and that was about an hour ago...\" John's face is pale, and Donny doesn't know what to say.",{"linkPath":"noTheresNoWayJoh","notIfConditions":null,"option":"It couldn't be","ifConditions":null},{"linkPath":"johnSwallowsAndP","notIfConditions":null,"option":"It must be","ifConditions":null}]},"whatTheHellHappe":{"content":["\"What the hell happened?\" The people in the stream are screaming now. Shock and confusion has overwhelmed them, and they start to run in random directions. John doesn't stir from where he lies on the ground.",{"divert":"donnyPutsHisPenD"}]},"thereIsASpaceInT":{"content":["There is a space in the case, which is lit by the moonlight. John knows that it's the kind of spot where something extremely important should go, but he hasn't found it yet. But he'll keep exploring the woods day after day until he finds it.",{"divert":"donnyPutsHisPenD"},{"notIfCondition":"gun"}]},"dammitJohnExclai":{"content":["\"Dammit,\" John exclaims as he spots the stream. There is a group of people wearing bright swim clothes paddling through the water. \"I was hoping for some privacy.\"",{"linkPath":"heyDipshitsWhyDo","notIfConditions":null,"option":"Confront the tourists","ifConditions":[{"ifCondition":"tourists"}]},{"linkPath":"johnGetsAMischie","notIfConditions":null,"option":"Scare them off","ifConditions":[{"ifCondition":"gun"}]},{"linkPath":"whateverIJustHop","notIfConditions":null,"option":"Swim anyways","ifConditions":[{"ifCondition":"happy"}]},{"linkPath":"whateverThoseAss","notIfConditions":null,"option":"Don't swim today","ifConditions":null}]},"johnSighsAndStar":{"content":["John sighs, and starts to move towards the shore. \"Guess that was long enough, should be moving along,\" John mutters to no one in particular. He shakes off the most of the water, puts on his shirt, and heads off towards the deeper part of the woods. As he walks, his pace increases, until he is running.",{"linkPath":"johnCrashesThrou","notIfConditions":null,"option":"Follow him","ifConditions":null}]},"theSpaceWhichCou":{"content":["The space which could have held the gun stands out like a sore thumb, and John can't stop staring at it. John doesn't get any sleep that night.",{"divert":"theSpaceWithTheG"},{"ifCondition":"shoot"},{"ifCondition":"throwgun"}]},"thatsProbablyEno":{"content":["\"That's probably enough excitement for one day,\" John says. He knows the right way to go to get back to the stream and the hill, so Donny lets him lead the way.",{"linkPath":"forAMomentItSeem","notIfConditions":null,"option":"Check the stream again","ifConditions":null},{"linkPath":"laterThatNightJo","notIfConditions":null,"option":"Head home","ifConditions":null},{"pageNum":3},{"pageLabel":" Back Home"}]},"donnyPutsHisPenD":{"content":["Donny puts his pen down on the table. John's story is finished.",{"pageNum":4},{"pageLabel":" End"}]},"johnCrashesThrou":{"content":["John crashes through the undergrowth, frustrated and swearing. Ever so often, he hits a patch of brambles, which only make him more frustrated, pushing him to run even faster. Donny has been watching this repeat for a few minutes now, and he's not quite sure where the path is any more.",{"divert":"johnEventuallySt"},{"pageNum":2},{"pageLabel":" Deep woods"}]},"iWonderWhatTheSt":{"content":["\"I wonder what the stream is like today,\" John muses, and starts to walk on towards the other side of the hill.",{"linkPath":"johnDoesntSayAny","notIfConditions":null,"option":"Continue On","ifConditions":null}]},"donnyStartsToMov":{"content":["Donny starts to move around the clearing. It's very beautiful and idyllic, with many small animals and insects running around. There is a massive beehive up in one of the trees, and a large oak that appears to have been struck by lightning.",{"linkPath":"johnLooksUpFromF","notIfConditions":null,"option":"Point out the beehive","ifConditions":null},{"linkPath":"johnSitsUpAndSee","notIfConditions":null,"option":"Point out the tree","ifConditions":null}]},"theseWoodsAreMyH":{"content":["\"These woods are my home.\" John's voice sounds distant and introspective, and Donny frowns slightly. He knew John loved the woods, but he wasn't expecting such deep feelings.",{"linkPath":"johnReclinesOnAn","notIfConditions":null,"option":"Linger in the undergrowth","ifConditions":null},{"linkPath":"iHopeNoneOfThose","notIfConditions":null,"option":"Push through","ifConditions":null},{"linkPath":"thePathThroughTh","notIfConditions":null,"option":"Turn up towards the hill","ifConditions":null}]},"JohnReachesDownT":{"content":[" John reaches down to the ground and picks up a large rock. He hefts it up towards the hive, not putting much effort into it. To Donny and John's astonishment, the rock reaches just high enough to knock against the hive, and it comes rocketing down towards the ground.",{"divert":"theBeesExplodeOu"}]},"johnDoesntSayAny":{"content":["John doesn't say anything the whole time down the hillside towards the stream. He races over the steep slopes, swinging around the trees like a monkey.",{"divert":"iHopeNoneOfThose"}]},"withALitheMotion":{"content":["With a lithe motion, John jumps up and grabs a nearby branch. He starts skillfully climbing the tree, pausing only to plan his route every so often. When he reaches the upper branches, he can see past most of the trees in the clearing, far into the woods.",{"linkPath":"withALaughOfGlee","notIfConditions":null,"option":"Go higher!","ifConditions":[{"ifCondition":"happy"}]},{"linkPath":"johnMakesHisWayD","notIfConditions":null,"option":"Climb down","ifConditions":null}]},"iLoveThisPlaceJo":{"content":["\"I love this place,\" John says quietly. \"I wish I could just stay out here forever, now that would be something.\" Donny understands what John is feeling, a mixture of longing and emptiness, and lets the silence hand in the air for a few minutes."]},"johnExpressesHis":{"content":["John expresses his condolences, and the ranger walks off. \"Holy shit...\" John says, \"I was so harsh to them earlier...\"",{"divert":"johnExpressesHis1"},{"ifCondition":"confrontation"}]},"thePathThroughTh":{"content":["The path through the woods turns up towards the hill, and without any conscious thought John starts heading up to the top. Donny doesn't mind heading up there, these woods are John's thing anyways.",{"linkPath":"theHillIsWideAnd","notIfConditions":null,"option":"Crest the top of the hill","ifConditions":null}]},"upOverTheRiseOrT":{"content":["\"Up over the rise, or take the long way around?\" Donny doesn't see much of a difference, but his opinion is obviously important to John.",{"linkPath":"theHillIsWideAnd","notIfConditions":null,"option":"Walk over the hill","ifConditions":null},{"linkPath":"theLongWayPushes","notIfConditions":null,"option":"Take the long way around","ifConditions":null}]},"whateverIJustHop":{"content":["\"Whatever, I just hope they don't cause any trouble.\" Donny is pleasantly surprised by this rare show of generosity from John. John takes off his shirt and wades into the water, lying on his back in the slow current.",{"divert":"donnyWatchesAsJo"}]},"likeShootingFish":{"content":["\"Like shooting fish in a barrel,\" John says gleefully, and fires a shot. The sound is deafening, but quickly passes. The beehive appears unharmed. \"Damn, missed.\" John lines up another shot.",{"divert":"whenTheGunGoesOf"}]},"johnSwallowsAndP":{"content":["John swallows and puts the gun back into his pocket. \"Can't tell anyone\" he mutters as he turns and starts to walk again.",{"divert":"laterThatNightJo"}]},"theSpaceWithTheG":{"content":["The space with the gun stands out like a sore thumb, and John can't stop staring at it. John doesn't get any sleep that night.",{"divert":"theSpaceWithTheG1"},{"ifCondition":"shoot"},{"notIfCondition":"throwgun"}]},"johnLaughsAsMore":{"content":["John laughs as more of the rock piles fall to the ground, and Donny grins. It's rare to see him in such a good mood.",{"divert":"iWonderWhatTheSt"},{"flagName":"happy"}]},"noTheresNoWayJoh":{"content":["\"No, there's no way,\" John suddenly hurls the gun into the woods. He marches off with a determined expression on his face.",{"divert":"laterThatNightJo"},{"flagName":"throwgun"}]},"timeToHeadBackJo":{"content":["\"Time to head back.\" John sounds a little stronger than he was before. Donny is glad that the time in the woods has helped him work through some of his feelings.",{"divert":"thatsProbablyEno"}]},"laterThatNightJo":{"content":["Later that night, John looks towards his trophy case. It contains all the relics he has found in the woods over the years.",{"divert":"theSpaceWhichCou"},{"pageNum":-1}]},"woahWhatIsThatJo":{"content":["\"Woah, what is that?\" John exclaims as he spots something metal hidden under the moss and leaves. With some difficulty, he pulls up a gun.",{"divert":"holyShitIWonderW"},{"flagName":"gun"}]},"theLongWayPushes":{"content":["The long way pushes through thick underbrush and trees. Some of the trees hang over the trail, creating a tunnel to walk through. It's a very beautiful scene.",{"divert":"theseWoodsAreMyH"}]},"theRangersFaceSu":{"content":["The ranger's face suddenly falls, \"There was an accident here about an hour ago. Some people were swimming in the stream when one of them was hit by a stray bullet. We're checking to make sure foul play wasn't involved, but for now it looks like a negligent hunter.\"",{"divert":"johnExpressesHis"}]},"iHopeNoneOfThose":{"content":["\"I hope none of those tourists are at the stream today,\" John finally says bitterly. The stream is his favorite part of the woods, but it's also a very popular spot. It's likely some people will be swimming today.",{"divert":"iHaveAGoodFeelin"},{"notIfCondition":"happy"}]},"cantThoseDamnIdi":{"content":["\"Can't those damn idiots leave nature alone?\" Donny thinks this is a bit harsh, but he is also a bit disturbed by the audacity of some people. \"I tell ya, sometimes I just want to smack these people upside the head.\" John appears a little more calm after his outburst, so Donny lets the point rest.",{"linkPath":"johnDoesntSayAny","notIfConditions":null,"option":"Continue on","ifConditions":null},{"linkPath":"johnLaughsAsMore","notIfConditions":null,"option":"Knock over more rocks","ifConditions":null},{"flagName":"tourists"}]},"theSpaceWithTheG1":{"content":["The space with the gun stands out in the moonlight, and John wonders about it for a moment. Life is fleeting, and it can end in the blink of an eye. Knowing that, he wants to spend every day walking through the woods.",{"divert":"thereIsASpaceInT"},{"ifCondition":"gun"},{"notIfCondition":"shoot"}]},"weHaveJustAsMuch":{"content":["\"We have just as much a right to be here as you,\" one of them finally says with a steely expression. John doesn't relent. \"People like you are ruining these woods.\" He storms off further into the woods.",{"linkPath":"johnCrashesThrou","notIfConditions":null,"option":"Follow John","ifConditions":null}]},"johnEventuallySt":{"content":["John eventually stops at a small clearing. He falls onto the grass and lets out a long yell. It's not a sad or angry yell, just the yell of someone who has too many emotions to deal with and needs to let them out.",{"linkPath":"donnyStartsToMov","notIfConditions":null,"option":"Leave John to rest","ifConditions":null}]},"heyThereHaveYouB":{"content":["\"Hey there, have you been out here long?\" The ranger asks amicably. \"Just a few hours,\" John replies cautiously, \"Is there anything wrong?\"",{"divert":"theRangersFaceSu"}]},"holyShitIWonderW":{"content":["\"Holy shit, I wonder who left this out here.\" Donny is feeling a little nervous, but John doesn't seem anything more than curious. \"Woah, I'll bet this was left by a criminal or something. Cool\" John pockets the gun, no doubt planning to put it in his trophy case later. Donny sighs, but this isn't out of character for John.",{"linkPath":"thePathThroughTh","notIfConditions":null,"option":"Head up towards the hill","ifConditions":null},{"linkPath":"iHopeNoneOfThose","notIfConditions":null,"option":"Push through","ifConditions":null}]},"johnsEyesMoveBac":{"content":["John's eyes move back and forth, but he cannot feel his arms and legs. He tries to cry out, but all he hears is a gurgling noise. He's not stupid, he knows he has broken his neck.",{"divert":"asTheTearsSlowly"}]},"imActuallyGladID":{"content":["\"I'm actually glad I didn't go to the stream today,\" John says quietly. \"It's usually crowded, and I just end up becoming angry.\" Donny understands what John is feeling, an mixture of contentment and frustration, and lets the silence hang in the air for a few minutes.",{"divert":"timeToHeadBackJo"}]}},"allowCheckpoints":false,"optionMirroring":true,"initial":"nothingIsBetterT","editorData":{"playPoint":"iLoveThisPlaceJo","authorName":"Justin Bool","libraryVisible":true,"textSize":0}},"url_key":"hhdh","title":"A Walk in the Woods","updated_at":"2015-10-15T00:55:53Z","created_at":"2015-10-14T22:40:37Z"}