{"data":{"stitches":{"timePassesHoursT":{"content":["Time passes. Hours turn into days, and days turn into months. You're not sure how long you've been suspended in this nothingness. All you know is that you are still alive, and help doesn't come no matter how much you scream.",{"divert":"theEnd"}]},"youRaceTowardsTh":{"content":["You race towards the door, it suddenly swings open. You are going too fast to stop yourself, so you end up thrown through to the other side.",{"divert":"ifYouThoughtTheR"}]},"youDontAppearToB":{"content":["You don't appear to be seriously hurt, but one of the splinters has scraped your arm, and there is fresh blood there.",{"linkPath":"theOnlyThingYouC","notIfConditions":null,"option":"Find a bandage","ifConditions":null},{"linkPath":"youDontNeedToWor","notIfConditions":null,"option":"Ignore it","ifConditions":null}]},"youPeelBackTheFa":{"content":["You peel back the fabric to look outside, and are suddenly blinded by a bright light. You step back and cover your eyes, but the light seems to still pierce through your eyelids and arm. The brightness starts to burn, and you stumble to the ground.",{"divert":"theBrightnessDoe"}]},"theKnifeIsDefini":{"content":["The knife is definitely sharp enough to cut through the covering on the window. You stride over to the window and begin cutting around the window frame. As you cut, more and more light spills into the room.",{"divert":"youPeelBackTheFa"}]},"aStudyInFlexibil":{"content":["/=A study in flexibility and the uncompromising human spirit=/*--*",{"linkPath":"groggilyYouBegin","notIfConditions":null,"option":"Wake Up","ifConditions":null}]},"anotherDoorButYo":{"content":["Another door, but your situation is unchanged. Without food or water, you won't last very long.",{"divert":"DaysLaterYouAreC"}]},"youStartHackingA":{"content":["You start hacking away at the door with the knife. The tip becomes embedded in the door, and when you try to work it free it breaks off. Undeterred, you continue to cleave at the wooden door.",{"divert":"progressIsSlowBu"}]},"youDontNeedToWor":{"content":["You don't need to worry about such a small cut, you have more important things to deal with. You are sick and tired of this room, it's time you got out.",{"linkPath":"youStandInFrontO","notIfConditions":null,"option":"Examine the door","ifConditions":null},{"flagName":"blood"}]},"theFridgeIsEmpty":{"content":["The fridge is empty, and doesn't appear to be running. A small amount of water splashes to the ground as the door is opened.",{"linkPath":"asYouLookDownInD","notIfConditions":null,"option":"No food at all?","ifConditions":null},{"linkPath":"outOfAngerAndFru","notIfConditions":null,"option":"Slam the door shut","ifConditions":null}]},"theEnd":{"content":["*-The End-*"]},"theLastLineInThe":{"content":["The last line in the notebook reads, \"HOPE IS LOST. PLEASE OH GOD PLEASE NO DONT LET ME DIE HERE WHY IS THIS HAPPENING I JUST WAN...\"",{"linkPath":"nothingHappensLo","notIfConditions":[{"notIfCondition":"lamp"}],"option":"Turn on the lamp","ifConditions":null},{"linkPath":null,"notIfConditions":null,"option":"Check the sheets","ifConditions":null}]},"inTheCornerOfThe":{"content":["In the corner of the room sits the queen-sized bed. There is a nightstand with a single drawer, on top of which sits a small lamp. The sheets are ruffled, as though someone hastily made the bed.",{"linkPath":"inTheDrawerIsASm","notIfConditions":null,"option":"Check the drawer","ifConditions":null},{"linkPath":"nothingHappensLo","notIfConditions":null,"option":"Turn on the lamp","ifConditions":null},{"linkPath":"underTheHastilyM","notIfConditions":null,"option":"Check the sheets","ifConditions":null}]},"toBeContinued":{"content":["*-To Be Continued-*"]},"onTheOtherSideIs":{"content":["On the other side is another small room, equally dimly lit. It looks nearly identical to the room you were in, with one major exception. Huddled in the middle of the room is a body.",{"divert":"youCarefullyWalk"}]},"theOutburstHelps":{"content":["The outburst helps, and you take a moment to sit on the ruined bed and contemplate your situation.",{"divert":"asYouLookAroundT"}]},"nothingHappensLo":{"content":["Nothing happens. Looking closer, you can see that the bulb is broken. There is dried blood on the edges of the glass.",{"linkPath":"underTheHastilyM","notIfConditions":null,"option":"Check the sheets","ifConditions":null},{"linkPath":"inTheDrawerIsASm","notIfConditions":[{"notIfCondition":"drawer"}],"option":"Check the drawer","ifConditions":null},{"flagName":"lamp"}]},"cantGetRoomFoodI":{"content":["\"Can't get... room. Food is almost gone, and I'll... to turn to... options.\" -- \"My only friend... walls. I can see them... taunting... I hate them.\" -- \"no this isnt hapening why me i just want some food why cant i get out i used the key and it just wont stop\"",{"divert":"theLastLineInThe"}]},"theWindowIsSmall":{"content":["The window is small and square, covered by a piece of heavy fabric affixed to the frame. You aren't able to move the fabric out of the way. A small amount of light leaks through the material, which leads you to believe it is day outside.",{"linkPath":"inTheCornerOfThe","notIfConditions":null,"option":"Walk to the Bed","ifConditions":null},{"linkPath":"theKnifeIsDefini","notIfConditions":null,"option":"Cut the fabric on the window","ifConditions":[{"ifCondition":"knife"}]},{"linkPath":"theKitchenConsis","notIfConditions":null,"option":"Walk to the kitchen","ifConditions":null},{"flagName":"window"}]},"ifYouThoughtTheR":{"content":["If you thought the room you were in was dark, it was nothing compared to the inky blackness that now surrounds you. You can't see anything, including the door you just ran through, and you can't feel anything, including the ground beneath your feet. There is a sensation of falling, and also a feeling of immense pressure, like being underwater.",{"divert":"timePassesHoursT"}]},"asYouPullUpTheSh":{"content":["As you pull up the sheets, you find a knife hidden in the bed. It is a kitchen knife, the kind you would use to cut meat. That's a lucky break.",{"divert":"cuttingTheSheets"},{"flagName":"knife"}]},"inTheDrawerIsASm":{"content":["In the drawer is a small notebook. You look through it, and find it completely filled with page after page of writing. The writing is hard to read, almost scribbles, but some of the passages are legible enough to make out.",{"divert":"cantGetRoomFoodI"},{"flagName":"drawer"}]},"itsLockedFromThe":{"content":["It's locked from the other side, as one might suspect. Your stomach begins to growl.",{"linkPath":null,"notIfConditions":null,"option":"Walk to the kitchen","ifConditions":null}]},"groggilyYouBegin":{"content":["Groggily, you begin to open your eyes. The world around you is swimming, and your thoughts fail to reach coherence. You are vaguely aware of lying prone on a hard surface.",{"linkPath":"shakingYourHeadV","notIfConditions":null,"option":"Snap out of it","ifConditions":null},{"flagName":"area = 1"}]},"theDarkRoom":{"content":["*-The Dark Room-*",{"divert":"aStudyInFlexibil"},{"pageNum":1}]},"hopelessnessStar":{"content":["Hopelessness starts to consume you. There isn't any way out of this room. It will become your grave. At least dying of starvation doesn't hurt too badly.",{"divert":"theEnd"}]},"youStandInFrontO":{"content":["You stand in front of the door, examining it closely. It's a fairly standard wooden door, there's no reason you can't just break it down.",{"divert":"youBeginToSlamYo"}]},"youCarefullyWalk":{"content":["You carefully walk closer, and can see that the person is clearly dead. The gray peeling skin and emaciated face are unmistakable. Whoever this was, they curled up into the fetal position on the ground and never rose again.",{"divert":"toBeContinued"}]},"progressIsSlowBu":{"content":["Progress is slow, but eventually you break enough of the door to pull it apart. By this point, you haven't eaten in several hours, and you are starting to feel weak. It's all you can do to keep from collapsing from stress.",{"linkPath":"youPullApartTheD","notIfConditions":null,"option":"Freedom?","ifConditions":null}]},"asThoroughAsYouA":{"content":["As thorough as you are, the key doesn't seem to have any effect on the door.",{"linkPath":"desperateYouStar","notIfConditions":null,"option":"Call for help","ifConditions":null}]},"theOnlyThingYouC":{"content":["The only thing you can think of to bind the wound are the bedsheets, but they're too large to tie around your arm",{"linkPath":"cuttingTheSheets","notIfConditions":null,"option":"Cut them with the knife","ifConditions":[{"ifCondition":"knife"}]},{"linkPath":"asYouPullUpTheSh","notIfConditions":[{"notIfCondition":"knife"}],"option":"Use them anyway","ifConditions":null}]},"underTheHastilyM":{"content":["Under the hastily made sheets is a knife, the kind that would be used in a kitchen to cut vegetables or fruits. It looks to be in good condition, with a very sharp edge.",{"divert":"youPickUpTheKnif"},{"flagName":"sheets"}]},"theKitchenConsis":{"content":["The kitchen consists of a small table with one chair, a small countertop, and a refrigerator. There is no food, and everything is covered with a layer of dust.",{"linkPath":"theFridgeIsEmpty","notIfConditions":null,"option":"Open the fridge","ifConditions":null}]},"youRipChunksOutO":{"content":["You rip chunks out of the wall, revealing a hidden door. It looks as though an extra piece of drywall was placed over the door and painted over. Turning the knob, you find that the door is locked.",{"linkPath":"theKeyWorksAndYo","notIfConditions":null,"option":"Use the key","ifConditions":[{"ifCondition":"key"}]},{"linkPath":"anotherDoorButYo","notIfConditions":null,"option":"Now what?","ifConditions":null},{"flagName":"door"}]},"yourFrustrationM":{"content":["Your frustration mounts, and you lose all patience. You start moving throughout the room, throwing things against the walls, knocking things over, causing general mayhem.",{"divert":"theOutburstHelps"}]},"youBeginToSlamYo":{"content":["You begin to slam your shoulder against the door rhythmically for several minutes. As you step back a bit and prepare to charge the door, you hear a small noise from the other side.",{"linkPath":"youRaceTowardsTh","notIfConditions":null,"option":"Charge it","ifConditions":null},{"linkPath":"youPauseToListen","notIfConditions":null,"option":"Wait a moment","ifConditions":null}]},"cuttingTheSheets":{"content":["Cutting the sheets into strips works perfectly, and the wound is quickly secured.",{"linkPath":"desperateYouStar","notIfConditions":null,"option":"You have to get out of here","ifConditions":null}]},"shakingYourHeadV":{"content":["Shaking your head violently, the world around you starts to pull together.",{"divert":"youAreSittingOnA"}]},"DaysLaterYouAreC":{"content":["5 days later, you are curled up in the middle of the room in the fetal position. You can tell that you're going to die, there's nothing else you can do. You just hope that death will allow you to finally escape.",{"divert":"theEnd"}]},"theKeyWorksAndYo":{"content":["The key works, and you open the door.",{"divert":"onTheOtherSideIs"}]},"afterAFewMinutes":{"content":["After a few minutes, the shaking stops. You listen intently for a long time, until you are sure that whatever it was is gone. The anxiety starts to make you feel dizzy.",{"linkPath":"youLetOutASighOf","notIfConditions":null,"option":"Relax","ifConditions":[{"ifCondition":"blood"}]},{"linkPath":"theDizzinessIncr","notIfConditions":null,"option":"Remain vigilant","ifConditions":null}]},"asYouLookDownInD":{"content":["As you look down in disappointment, you notice something small and metal in the back of the fridge. It is a bronze key. You put it in your pocket for later.",{"linkPath":"theKeySeemsToWor","notIfConditions":null,"option":"Check the door","ifConditions":null},{"flagName":"key"}]},"youAreSittingOnA":{"content":["You are sitting on a wooden floor. Around you, through a dim light, you can see what looks like someone's apartment. A bed is set up in one corner, and a kitchen in another. In front of you is a door, the only one you can see. The light is coming from a single window with the curtains closed.",{"linkPath":"inTheCornerOfThe","notIfConditions":null,"option":"Walk to the bed","ifConditions":null},{"linkPath":"theWindowIsSmall","notIfConditions":null,"option":"Walk to the window","ifConditions":null},{"linkPath":"theKitchenConsis","notIfConditions":null,"option":"Walk to the kitchen","ifConditions":null},{"linkPath":"itsLockedFromThe","notIfConditions":null,"option":"Walk to the door","ifConditions":null}]},"youPullApartTheD":{"content":["You pull apart the door, and look through the doorway. Right in front of you is a brick wall that sat just behind the door. There is no way a little knife will get through it.",{"divert":"hopeDrainsFromYo"}]},"theDizzinessOnly":{"content":["The dizziness only gets worse as you slump to the ground. Lights dance in front of your eyes, and you feel very drowsy. You probably won't wake from this sleep.",{"divert":"theEnd"}]},"desperateYouStar":{"content":["Desperate, you start banging on the door and calling for help. This goes on for a few minutes before you start to tire, and you slump into a pile in front of the door. ",{"linkPath":"hopelessnessStar","notIfConditions":null,"option":"Give up","ifConditions":null},{"linkPath":"thereHasToBeSome","notIfConditions":null,"option":"Try something","ifConditions":null}]},"theKeySeemsToWor":{"content":["The key seems to work on the lock, but the door doesn't open no matter how you turn it. It's as though there is a second lock on the door, but you can't see anything from this side.",{"linkPath":"asThoroughAsYouA","notIfConditions":null,"option":"Try the lock again","ifConditions":null},{"linkPath":"desperateYouStar","notIfConditions":null,"option":"Call for help","ifConditions":null}]},"outOfAngerAndFru":{"content":["Out of anger and frustration, you slam the door of the fridge closed. The motion causes you to slip on the wet ground in front of it, and you come crashing down against the table. The cheap table buckles under your weight, and breaks into splinters.",{"divert":"youDontAppearToB"}]},"asYouLookAroundT":{"content":["As you look around the room, you notice something you couldn't see before. In your outburst, you knocked a hole in the wall, and through that hole you can see a doorknob.",{"linkPath":"youRipChunksOutO","notIfConditions":null,"option":"Pull apart the wall","ifConditions":null}]},"youLetOutASighOf":{"content":["You let out a sigh of relief. Whatever it was, it must be gone by now. You look down, and see a pool of blood at your feet. Shocked, you examine your arm, and find that the cut was a lot more serious than you thought it was. It is dripping blood at a steady rate.",{"divert":"theDizzinessOnly"}]},"thereHasToBeSome":{"content":["There has to be some way out of this room, but you can't see anything that will help you.",{"linkPath":"youStartHackingA","notIfConditions":null,"option":"Hack the door to pieces","ifConditions":[{"ifCondition":"knife"}]},{"linkPath":"yourFrustrationM","notIfConditions":null,"option":"Get mad","ifConditions":null}]},"youPauseToListen":{"content":["You pause to listen for the sound. After a few seconds of silence, the door begins to shake and rattle. You freeze, unable to move.",{"divert":"afterAFewMinutes"}]},"theBrightnessDoe":{"content":["The brightness does not abate, and only seems to increase in intensity. Your mind unravels and your skin burns, and pain is the last sensation you feel as you die.",{"divert":"theEnd"}]},"hopeDrainsFromYo":{"content":["Hope drains from you as you collapse in exhaustion. Although you are sweating profusely, your body is still not cooling down. You can hear your heart racing, beating like a drum. Then, suddenly, your heartbeat is replaced by a deafening silence. You don't get up.",{"divert":"theEnd"}]},"theDizzinessIncr":{"content":["The dizziness increases, until you need to sit down. You are vaguely aware of slumping against the door. Your vision is swimming, and you start to develop a pounding headache. After a few minutes, you start to feel better.",{"divert":"thereHasToBeSome"}]},"youPickUpTheKnif":{"content":["You pick up the knife and carefully place it in your pocket. It could come in handy later.",{"linkPath":"theKnifeIsDefini","notIfConditions":null,"option":"Cut the fabric on the window","ifConditions":[{"ifCondition":"window"}]},{"linkPath":"theWindowIsSmall","notIfConditions":[{"notIfCondition":"window"}],"option":"Walk to the window","ifConditions":null},{"linkPath":"theKitchenConsis","notIfConditions":null,"option":"Walk to the kitchen","ifConditions":null},{"flagName":"knife = 1"}]}},"allowCheckpoints":false,"optionMirroring":true,"initial":"theDarkRoom","editorData":{"playPoint":"groggilyYouBegin","authorName":"Justin Bool","libraryVisible":false,"textSize":0}},"url_key":"rr8r","title":"The Dark Room","updated_at":"2015-10-14T00:00:00Z","created_at":"2015-10-14T22:38:30Z"}